MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX330F064H.PIC
<?xml version="1.0" encoding="UTF-8" standalone="no"?><edc:PIC xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" edc:arch="32xxxx" edc:desc="" edc:dosid="01618" edc:dsid="60001185" edc:informedby="DOS" edc:isextended="false" edc:masksetid="TRAD" edc:name="PIC32MX330F064H" edc:procid="0x024E" edc:psid="60001145" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Import/>
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.300" edc:maxvoltage="3.600" edc:minvoltage="2.500"/>
    <edc:VDD edc:maxdefaultvoltage="3.600" edc:maxvoltage="3.600" edc:mindefaultvoltage="2.500" edc:minvoltage="2.500" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haschecksum="true" edc:haslvp2="true">
    <edc:ProgrammingWaitTime edc:progop="erase"/>
    <edc:ProgrammingWaitTime edc:progop="pgm"/>
    <edc:ProgrammingWaitTime edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:progop="pgm"/>
    <edc:ProgrammingRowSize edc:progop="cfg"/>
    <edc:ProgrammingRowSize edc:nzsize="4096" edc:progop="rowerase"/>
    <edc:Wait edc:cfg="" edc:erase="" edc:pgm=""/>
    <edc:Latches edc:cfg="" edc:pgm="" edc:rowerase="4096"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="32xxxx" edc:name="32xxxx">
    <edc:MemTraits edc:addrinc="0x4" edc:locsize="0x4" edc:wordimpl="0xffffffff" edc:wordinit="0xffffffff" edc:wordsafe="0xffffffff" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet>
    <edc:InstructionSet edc:instructionsetid="mips32r2"/>
    <edc:InstructionSet edc:instructionsetid="mips16"/>
  </edc:InstructionSet>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:InterruptList edc:interruptcontrollerflavor="int_evic_v1" edc:shadowsetcount="2" ltx:defaultbaseaddr="0x9FC01000">
    <edc:Interrupt edc:cname="CORE_TIMER" edc:desc="Core Timer" edc:irq="0"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software 0" edc:irq="1"/>
    <edc:Interrupt edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="EXTERNAL_0" edc:desc="Ext INT 0" edc:irq="3"/>
    <edc:Interrupt edc:cname="TIMER_1" edc:desc="Timer1" edc:irq="4"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_1" edc:desc="Input Capture 1" edc:irq="5"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_1" edc:desc="Output Compare 1" edc:irq="6"/>
    <edc:Interrupt edc:cname="EXTERNAL_1" edc:desc="Ext INT 1" edc:irq="7"/>
    <edc:Interrupt edc:cname="TIMER_2" edc:desc="Timer2" edc:irq="8"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_2" edc:desc="Input Capture 2" edc:irq="9"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_2" edc:desc="Output Compare 2" edc:irq="10"/>
    <edc:Interrupt edc:cname="EXTERNAL_2" edc:desc="Ext INT 2" edc:irq="11"/>
    <edc:Interrupt edc:cname="TIMER_3" edc:desc="Timer3" edc:irq="12"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_3" edc:desc="Input Capture 3" edc:irq="13"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_3" edc:desc="Output Compare 3" edc:irq="14"/>
    <edc:Interrupt edc:cname="EXTERNAL_3" edc:desc="Ext INT 3" edc:irq="15"/>
    <edc:Interrupt edc:cname="TIMER_4" edc:desc="Timer4" edc:irq="16"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_4" edc:desc="Input Capture 4" edc:irq="17"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_4" edc:desc="Output Compare 4" edc:irq="18"/>
    <edc:Interrupt edc:cname="EXTERNAL_4" edc:desc="Ext INT 4" edc:irq="19"/>
    <edc:Interrupt edc:cname="TIMER_5" edc:desc="Timer5" edc:irq="20"/>
    <edc:Interrupt edc:cname="INPUT_CAPTURE_5" edc:desc="Input Capture 5" edc:irq="21"/>
    <edc:Interrupt edc:cname="OUTPUT_COMPARE_5" edc:desc="Output Compare 5" edc:irq="22"/>
    <edc:Interrupt edc:cname="ADC" edc:desc="ADC" edc:irq="23"/>
    <edc:Interrupt edc:cname="FAIL_SAFE_MONITOR" edc:desc="Fail Safe Clock Monitor" edc:irq="24"/>
    <edc:Interrupt edc:cname="RTCC" edc:desc="Real Time Clock Calendar" edc:irq="25"/>
    <edc:Interrupt edc:cname="FCE" edc:desc="Flash Control Event" edc:irq="26"/>
    <edc:Interrupt edc:cname="COMPARATOR_1" edc:desc="Comparator 1" edc:irq="27"/>
    <edc:Interrupt edc:cname="COMPARATOR_2" edc:desc="Comparator 2" edc:irq="28"/>
    <edc:Interrupt edc:cname="SPI_1" edc:desc="SPI1" edc:irq="30"/>
    <edc:Interrupt edc:cname="UART_1" edc:desc="UART 1" edc:irq="31"/>
    <edc:Interrupt edc:cname="I2C_1" edc:desc="I2C 1" edc:irq="32"/>
    <edc:Interrupt edc:cname="CHANGE_NOTICE" edc:desc="Change Notice" edc:irq="33"/>
    <edc:Interrupt edc:cname="PMP" edc:desc="PMP" edc:irq="34"/>
    <edc:Interrupt edc:cname="SPI_2" edc:desc="SPI 2" edc:irq="35"/>
    <edc:Interrupt edc:cname="UART_2" edc:desc="UART 2" edc:irq="36"/>
    <edc:Interrupt edc:cname="I2C_2" edc:desc="I2C 2" edc:irq="37"/>
    <edc:Interrupt edc:cname="UART_3" edc:desc="UART_3" edc:irq="38"/>
    <edc:Interrupt edc:cname="UART_4" edc:desc="UART_4" edc:irq="39"/>
    <edc:Interrupt edc:cname="CTMU" edc:desc="CTMU Event" edc:irq="41"/>
    <edc:Interrupt edc:cname="DMA_0" edc:desc="DMA Channel 0" edc:irq="42"/>
    <edc:Interrupt edc:cname="DMA_1" edc:desc="DMA Channel 1" edc:irq="43"/>
    <edc:Interrupt edc:cname="DMA_2" edc:desc="DMA Channel 2" edc:irq="44"/>
    <edc:Interrupt edc:cname="DMA_3" edc:desc="DMA Channel 3" edc:irq="45"/>
    <edc:InterruptRequest edc:cname="CORE_TIMER" edc:desc="Core Timer" edc:irq="0"/>
    <edc:InterruptRequest edc:cname="CORE_SOFTWARE_0" edc:desc="Core Software 0" edc:irq="1"/>
    <edc:InterruptRequest edc:cname="CORE_SOFTWARE_1" edc:desc="Core Software 1" edc:irq="2"/>
    <edc:InterruptRequest edc:cname="EXTERNAL_0" edc:desc="Ext INT 0" edc:irq="3"/>
    <edc:InterruptRequest edc:cname="TIMER_1" edc:desc="Timer 1" edc:irq="4"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_ERROR_1" edc:desc="Input Capature 1 Error" edc:irq="5"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_1" edc:desc="Input Capture 1" edc:irq="6"/>
    <edc:InterruptRequest edc:cname="OUTPUT_COMPARE_1" edc:desc="Output Compare 1" edc:irq="7"/>
    <edc:InterruptRequest edc:cname="EXTERNAL_1" edc:desc="Ext INT 1" edc:irq="8"/>
    <edc:InterruptRequest edc:cname="TIMER_2" edc:desc="Timer 2" edc:irq="9"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_ERROR_2" edc:desc="Input Capture 2 Error" edc:irq="10"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_2" edc:desc="Input Capture 2" edc:irq="11"/>
    <edc:InterruptRequest edc:cname="OUTPUT_COMPARE_2" edc:desc="Output Compare 2" edc:irq="12"/>
    <edc:InterruptRequest edc:cname="EXTERNAL_2" edc:desc="External INT 2" edc:irq="13"/>
    <edc:InterruptRequest edc:cname="TIMER_3" edc:desc="Timer 3" edc:irq="14"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_ERROR_3" edc:desc="Input Capture 3 Error" edc:irq="15"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_3" edc:desc="Input Capture 3" edc:irq="16"/>
    <edc:InterruptRequest edc:cname="OUTPUT_COMPARE_3" edc:desc="Output Compare 3" edc:irq="17"/>
    <edc:InterruptRequest edc:cname="EXTERNAL_3" edc:desc="Ext INT 3" edc:irq="18"/>
    <edc:InterruptRequest edc:cname="TIMER_4" edc:desc="Timer 4" edc:irq="19"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_ERROR_4" edc:desc="Input Capture 4 Error" edc:irq="20"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_4" edc:desc="Input Capture 4" edc:irq="21"/>
    <edc:InterruptRequest edc:cname="OUTPUT_COMPARE_4" edc:desc="Output Compare 4" edc:irq="22"/>
    <edc:InterruptRequest edc:cname="EXTERNAL_4" edc:desc="Ext INT 4" edc:irq="23"/>
    <edc:InterruptRequest edc:cname="TIMER_5" edc:desc="Timer 5" edc:irq="24"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_ERROR_5" edc:desc="Input Capture 5 Error" edc:irq="25"/>
    <edc:InterruptRequest edc:cname="INPUT_CAPTURE_5" edc:desc="Input Capture 5" edc:irq="26"/>
    <edc:InterruptRequest edc:cname="OUTPUT_COMPARE_5" edc:desc="Output Compare 5" edc:irq="27"/>
    <edc:InterruptRequest edc:cname="ADC" edc:desc="ADC1 Convert Done" edc:irq="28"/>
    <edc:InterruptRequest edc:cname="FAIL_SAFE_MONITOR" edc:desc="Fail Safe Clock Monitor" edc:irq="29"/>
    <edc:InterruptRequest edc:cname="RTCC" edc:desc="Real Time Clock Calendar" edc:irq="30"/>
    <edc:InterruptRequest edc:cname="FLASH_CONTROL" edc:desc="" edc:irq="31"/>
    <edc:InterruptRequest edc:cname="COMPARATOR_1" edc:desc="Comparator 1" edc:irq="32"/>
    <edc:InterruptRequest edc:cname="COMPARATOR_2" edc:desc="Comparator 2" edc:irq="33"/>
    <edc:InterruptRequest edc:cname="SPI1_ERR" edc:desc="SPI1 Fault" edc:irq="35"/>
    <edc:InterruptRequest edc:cname="SPI1_RX" edc:desc="SPI1 Receive Done" edc:irq="36"/>
    <edc:InterruptRequest edc:cname="SPI1_TX" edc:desc="SPI1 Transmit Done" edc:irq="37"/>
    <edc:InterruptRequest edc:cname="UART1_ERR" edc:desc="UART1 Error" edc:irq="38"/>
    <edc:InterruptRequest edc:cname="UART1_RX" edc:desc="UART1 Receiver" edc:irq="39"/>
    <edc:InterruptRequest edc:cname="UART1_TX" edc:desc="UART1 Trasmitter" edc:irq="40"/>
    <edc:InterruptRequest edc:cname="I2C1_BUS" edc:desc="I2C1 Bus Collision Event" edc:irq="41"/>
    <edc:InterruptRequest edc:cname="I2C1_SLAVE" edc:desc="I2C1 Slave Event" edc:irq="42"/>
    <edc:InterruptRequest edc:cname="I2C1_MASTER" edc:desc="I2C1 Master Event" edc:irq="43"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_A" edc:desc="Part A Change Notice" edc:irq="44"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_B" edc:desc="Part B Change Notice" edc:irq="45"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_C" edc:desc="Part C Change Notice" edc:irq="46"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_D" edc:desc="Part D Change Notice" edc:irq="47"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_E" edc:desc="Part E Change Notice" edc:irq="48"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_F" edc:desc="Part F Change Notice" edc:irq="49"/>
    <edc:InterruptRequest edc:cname="CHANGE_NOTICE_G" edc:desc="Part G Change Notice" edc:irq="50"/>
    <edc:InterruptRequest edc:cname="PMP" edc:desc="Parallel Master Port" edc:irq="51"/>
    <edc:InterruptRequest edc:cname="PMP_ERROR" edc:desc="PMP Error" edc:irq="52"/>
    <edc:InterruptRequest edc:cname="SPI2_ERR" edc:desc="SPI2 Error" edc:irq="53"/>
    <edc:InterruptRequest edc:cname="SPI2_RX" edc:desc="SPI2 Receiver" edc:irq="54"/>
    <edc:InterruptRequest edc:cname="SPI2_TX" edc:desc="SPI2 Trasmitter" edc:irq="55"/>
    <edc:InterruptRequest edc:cname="UART2_ERR" edc:desc="UART2 Error" edc:irq="56"/>
    <edc:InterruptRequest edc:cname="UART2_RX" edc:desc="UART2 Receiver" edc:irq="57"/>
    <edc:InterruptRequest edc:cname="UART2_TX" edc:desc="UART2 Trasmitter" edc:irq="58"/>
    <edc:InterruptRequest edc:cname="I2C2_BUS" edc:desc="I2C2 Bus Collision Event" edc:irq="59"/>
    <edc:InterruptRequest edc:cname="I2C2_SLAVE" edc:desc="I2C2 Slave Event" edc:irq="60"/>
    <edc:InterruptRequest edc:cname="I2C2_MASTER" edc:desc="I2C2 Master Event" edc:irq="61"/>
    <edc:InterruptRequest edc:cname="UART3_ERR" edc:desc="UART3 Error" edc:irq="62"/>
    <edc:InterruptRequest edc:cname="UART3_RX" edc:desc="UART3 Receiver" edc:irq="63"/>
    <edc:InterruptRequest edc:cname="UART3_TX" edc:desc="UART3 Transmitter" edc:irq="64"/>
    <edc:InterruptRequest edc:cname="UART4_ERR" edc:desc="UART4 Error" edc:irq="65"/>
    <edc:InterruptRequest edc:cname="UART4_RX" edc:desc="UART4 Receiver" edc:irq="66"/>
    <edc:InterruptRequest edc:cname="UART4_TX" edc:desc="UART4 Transmitter" edc:irq="67"/>
    <edc:InterruptRequest edc:cname="CTMU" edc:desc="CTMU Event" edc:irq="71"/>
    <edc:InterruptRequest edc:cname="DMA0" edc:desc="" edc:irq="72"/>
    <edc:InterruptRequest edc:cname="DMA1" edc:desc="" edc:irq="73"/>
    <edc:InterruptRequest edc:cname="DMA2" edc:desc="" edc:irq="74"/>
    <edc:InterruptRequest edc:cname="DMA3" edc:desc="" edc:irq="75"/>
  </edc:InterruptList>
  <edc:Breakpoints edc:hwbpcount="6"/>
  <edc:ProjectionTable edc:ksegmask="0xFF000000">
    <edc:Projection edc:ksegval="0x7D000000" edc:ptovop="XOR" edc:ptovval="0x60000000" edc:vtopop="XOR" edc:vtopval="0x60000000"/>
    <edc:Projection edc:ksegval="0x7F000000" edc:ptovop="XOR" edc:ptovval="0x7F000000" edc:vtopop="XOR" edc:vtopval="0x7F000000"/>
    <edc:Projection edc:ksegval="0x80000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9D000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0x9F000000" edc:ptovop="XOR" edc:ptovval="0x80000000" edc:vtopop="XOR" edc:vtopval="0x80000000"/>
    <edc:Projection edc:ksegval="0xA0000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBD000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
    <edc:Projection edc:ksegval="0xBF000000" edc:ptovop="XOR" edc:ptovval="0xA0000000" edc:vtopop="XOR" edc:vtopval="0xA0000000"/>
  </edc:ProjectionTable>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="zero" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="zero" edc:nmmrflags="St" edc:nmmrid="0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000"/>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="at" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="at" edc:nmmrflags="St" edc:nmmrid="4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="at" edc:desc="" edc:mask="0xffffffff" edc:name="at" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_modsrc="32xxxx-NMMR.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="v0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="v0" edc:nmmrflags="SEt" edc:nmmrid="8" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="v0" edc:desc="" edc:mask="0xffffffff" edc:name="v0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
