MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX330F064H.PIC
      <edc:DCRDef edc:_addr="0x1FC02FFC" edc:access="---n---n-----nnnnnnn-------nn-nn" edc:cname="DEVCFG0" edc:default="0x7fffffff" edc:desc="" edc:factorydefault="0x7fffffff" edc:impl="0x910ff01f" edc:name="DEVCFG0" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0x110ff01f">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="DEBUG" edc:desc="Background Debugger Enable" edc:mask="0x3" edc:name="DEBUG" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Debugger is Enabled" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Debugger is Disabled" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="JTAGEN" edc:desc="JTAG Enable" edc:mask="0x1" edc:name="JTAGEN" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="JTAG Port Enabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="JTAG Disabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="ICESEL" edc:desc="ICE/ICD Comm Channel Select" edc:mask="0x3" edc:name="ICESEL" edc:nzwidth="2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGx1" edc:desc="Communicate on PGEC1/PGED1" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx2" edc:desc="Communicate on PGEC2/PGED2" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="ICS_PGx3" edc:desc="Communicate on PGEC3/PGED3" edc:when="(field &amp; 0x3) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="PWP" edc:desc="Program Flash Write Protect" edc:mask="0xff" edc:name="PWP" edc:nzwidth="0x8">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disable" edc:when="(field &amp; 0xff) == 0xff"/>
              <edc:DCRFieldSemantic edc:cname="PWP4K" edc:desc="First 4K" edc:when="(field &amp; 0xff) == 0xfe"/>
              <edc:DCRFieldSemantic edc:cname="PWP8K" edc:desc="First 8K" edc:when="(field &amp; 0xff) == 0xfd"/>
              <edc:DCRFieldSemantic edc:cname="PWP12K" edc:desc="First 12K" edc:when="(field &amp; 0xff) == 0xfc"/>
              <edc:DCRFieldSemantic edc:cname="PWP16K" edc:desc="First 16K" edc:when="(field &amp; 0xff) == 0xfb"/>
              <edc:DCRFieldSemantic edc:cname="PWP20K" edc:desc="First 20K" edc:when="(field &amp; 0xff) == 0xfa"/>
              <edc:DCRFieldSemantic edc:cname="PWP24K" edc:desc="First 24K" edc:when="(field &amp; 0xff) == 0xf9"/>
              <edc:DCRFieldSemantic edc:cname="PWP28K" edc:desc="First 28K" edc:when="(field &amp; 0xff) == 0xf8"/>
              <edc:DCRFieldSemantic edc:cname="PWP32K" edc:desc="First 32K" edc:when="(field &amp; 0xff) == 0xf7"/>
              <edc:DCRFieldSemantic edc:cname="PWP36K" edc:desc="First 36K" edc:when="(field &amp; 0xff) == 0xf6"/>
              <edc:DCRFieldSemantic edc:cname="PWP40K" edc:desc="First 40K" edc:when="(field &amp; 0xff) == 0xf5"/>
              <edc:DCRFieldSemantic edc:cname="PWP44K" edc:desc="First 44K" edc:when="(field &amp; 0xff) == 0xf4"/>
              <edc:DCRFieldSemantic edc:cname="PWP48K" edc:desc="First 48K" edc:when="(field &amp; 0xff) == 0xf3"/>
              <edc:DCRFieldSemantic edc:cname="PWP52K" edc:desc="First 52K" edc:when="(field &amp; 0xff) == 0xf2"/>
              <edc:DCRFieldSemantic edc:cname="PWP56K" edc:desc="First 56K" edc:when="(field &amp; 0xff) == 0xf1"/>
              <edc:DCRFieldSemantic edc:cname="PWP60K" edc:desc="First 60K" edc:when="(field &amp; 0xff) == 0xf0"/>
              <edc:DCRFieldSemantic edc:cname="PWP64K" edc:desc="First 64K" edc:when="(field &amp; 0xff) == 0xef"/>
              <edc:DCRFieldSemantic edc:cname="PWP68K" edc:desc="First 68K" edc:when="(field &amp; 0xff) == 0xee"/>
              <edc:DCRFieldSemantic edc:cname="PWP72K" edc:desc="First 72K" edc:when="(field &amp; 0xff) == 0xed"/>
              <edc:DCRFieldSemantic edc:cname="PWP76K" edc:desc="First 76K" edc:when="(field &amp; 0xff) == 0xec"/>
              <edc:DCRFieldSemantic edc:cname="PWP80K" edc:desc="First 80K" edc:when="(field &amp; 0xff) == 0xeb"/>
              <edc:DCRFieldSemantic edc:cname="PWP84K" edc:desc="First 84K" edc:when="(field &amp; 0xff) == 0xea"/>
              <edc:DCRFieldSemantic edc:cname="PWP88K" edc:desc="First 88K" edc:when="(field &amp; 0xff) == 0xe9"/>
              <edc:DCRFieldSemantic edc:cname="PWP92K" edc:desc="First 92K" edc:when="(field &amp; 0xff) == 0xe8"/>
              <edc:DCRFieldSemantic edc:cname="PWP96K" edc:desc="First 96K" edc:when="(field &amp; 0xff) == 0xe7"/>
              <edc:DCRFieldSemantic edc:cname="PWP100K" edc:desc="First 100K" edc:when="(field &amp; 0xff) == 0xe6"/>
              <edc:DCRFieldSemantic edc:cname="PWP104K" edc:desc="First 104K" edc:when="(field &amp; 0xff) == 0xe5"/>
              <edc:DCRFieldSemantic edc:cname="PWP108K" edc:desc="First 108K" edc:when="(field &amp; 0xff) == 0xe4"/>
              <edc:DCRFieldSemantic edc:cname="PWP112K" edc:desc="First 112K" edc:when="(field &amp; 0xff) == 0xe3"/>
              <edc:DCRFieldSemantic edc:cname="PWP116K" edc:desc="First 116K" edc:when="(field &amp; 0xff) == 0xe2"/>
              <edc:DCRFieldSemantic edc:cname="PWP120K" edc:desc="First 120K" edc:when="(field &amp; 0xff) == 0xe1"/>
              <edc:DCRFieldSemantic edc:cname="PWP124K" edc:desc="First 124K" edc:when="(field &amp; 0xff) == 0xe0"/>
              <edc:DCRFieldSemantic edc:cname="PWP128K" edc:desc="First 128K" edc:when="(field &amp; 0xff) == 0xdf"/>
              <edc:DCRFieldSemantic edc:cname="PWP132K" edc:desc="First 132K" edc:when="(field &amp; 0xff) == 0xde"/>
              <edc:DCRFieldSemantic edc:cname="PWP136K" edc:desc="First 136K" edc:when="(field &amp; 0xff) == 0xdd"/>
              <edc:DCRFieldSemantic edc:cname="PWP140K" edc:desc="First 140K" edc:when="(field &amp; 0xff) == 0xdc"/>
              <edc:DCRFieldSemantic edc:cname="PWP144K" edc:desc="First 144K" edc:when="(field &amp; 0xff) == 0xdb"/>
              <edc:DCRFieldSemantic edc:cname="PWP148K" edc:desc="First 148K" edc:when="(field &amp; 0xff) == 0xda"/>
              <edc:DCRFieldSemantic edc:cname="PWP152K" edc:desc="First 152K" edc:when="(field &amp; 0xff) == 0xd9"/>
              <edc:DCRFieldSemantic edc:cname="PWP156K" edc:desc="First 156K" edc:when="(field &amp; 0xff) == 0xd8"/>
              <edc:DCRFieldSemantic edc:cname="PWP160K" edc:desc="First 160K" edc:when="(field &amp; 0xff) == 0xd7"/>
              <edc:DCRFieldSemantic edc:cname="PWP164K" edc:desc="First 164K" edc:when="(field &amp; 0xff) == 0xd6"/>
              <edc:DCRFieldSemantic edc:cname="PWP168K" edc:desc="First 168K" edc:when="(field &amp; 0xff) == 0xd5"/>
              <edc:DCRFieldSemantic edc:cname="PWP172K" edc:desc="First 172K" edc:when="(field &amp; 0xff) == 0xd4"/>
              <edc:DCRFieldSemantic edc:cname="PWP176K" edc:desc="First 176K" edc:when="(field &amp; 0xff) == 0xd3"/>
              <edc:DCRFieldSemantic edc:cname="PWP180K" edc:desc="First 180K" edc:when="(field &amp; 0xff) == 0xd2"/>
              <edc:DCRFieldSemantic edc:cname="PWP184K" edc:desc="First 184K" edc:when="(field &amp; 0xff) == 0xd1"/>
              <edc:DCRFieldSemantic edc:cname="PWP188K" edc:desc="First 188K" edc:when="(field &amp; 0xff) == 0xd0"/>
              <edc:DCRFieldSemantic edc:cname="PWP192K" edc:desc="First 192K" edc:when="(field &amp; 0xff) == 0xcf"/>
              <edc:DCRFieldSemantic edc:cname="PWP196K" edc:desc="First 196K" edc:when="(field &amp; 0xff) == 0xce"/>
              <edc:DCRFieldSemantic edc:cname="PWP200K" edc:desc="First 200K" edc:when="(field &amp; 0xff) == 0xcd"/>
              <edc:DCRFieldSemantic edc:cname="PWP204K" edc:desc="First 204K" edc:when="(field &amp; 0xff) == 0xcc"/>
              <edc:DCRFieldSemantic edc:cname="PWP208K" edc:desc="First 208K" edc:when="(field &amp; 0xff) == 0xcb"/>
              <edc:DCRFieldSemantic edc:cname="PWP212K" edc:desc="First 212K" edc:when="(field &amp; 0xff) == 0xca"/>
              <edc:DCRFieldSemantic edc:cname="PWP216K" edc:desc="First 216K" edc:when="(field &amp; 0xff) == 0xc9"/>
              <edc:DCRFieldSemantic edc:cname="PWP220K" edc:desc="First 220K" edc:when="(field &amp; 0xff) == 0xc8"/>
              <edc:DCRFieldSemantic edc:cname="PWP224K" edc:desc="First 224K" edc:when="(field &amp; 0xff) == 0xc7"/>
              <edc:DCRFieldSemantic edc:cname="PWP228K" edc:desc="First 228K" edc:when="(field &amp; 0xff) == 0xc6"/>
              <edc:DCRFieldSemantic edc:cname="PWP232K" edc:desc="First 232K" edc:when="(field &amp; 0xff) == 0xc5"/>
              <edc:DCRFieldSemantic edc:cname="PWP236K" edc:desc="First 236K" edc:when="(field &amp; 0xff) == 0xc4"/>
              <edc:DCRFieldSemantic edc:cname="PWP240K" edc:desc="First 240K" edc:when="(field &amp; 0xff) == 0xc3"/>
              <edc:DCRFieldSemantic edc:cname="PWP244K" edc:desc="First 244K" edc:when="(field &amp; 0xff) == 0xc2"/>
              <edc:DCRFieldSemantic edc:cname="PWP248K" edc:desc="First 248K" edc:when="(field &amp; 0xff) == 0xc1"/>
              <edc:DCRFieldSemantic edc:cname="PWP252K" edc:desc="First 252K" edc:when="(field &amp; 0xff) == 0xc0"/>
              <edc:DCRFieldSemantic edc:cname="PWP256K" edc:desc="First 256K" edc:when="(field &amp; 0xff) == 0xbf"/>
              <edc:DCRFieldSemantic edc:cname="PWP260K" edc:desc="First 260K" edc:when="(field &amp; 0xff) == 0xbe"/>
              <edc:DCRFieldSemantic edc:cname="PWP264K" edc:desc="First 264K" edc:when="(field &amp; 0xff) == 0xbd"/>
              <edc:DCRFieldSemantic edc:cname="PWP268K" edc:desc="First 268K" edc:when="(field &amp; 0xff) == 0xbc"/>
              <edc:DCRFieldSemantic edc:cname="PWP272K" edc:desc="First 272K" edc:when="(field &amp; 0xff) == 0xbb"/>
              <edc:DCRFieldSemantic edc:cname="PWP276K" edc:desc="First 276K" edc:when="(field &amp; 0xff) == 0xba"/>
              <edc:DCRFieldSemantic edc:cname="PWP280K" edc:desc="First 280K" edc:when="(field &amp; 0xff) == 0xb9"/>
              <edc:DCRFieldSemantic edc:cname="PWP284K" edc:desc="First 284K" edc:when="(field &amp; 0xff) == 0xb8"/>
              <edc:DCRFieldSemantic edc:cname="PWP288K" edc:desc="First 288K" edc:when="(field &amp; 0xff) == 0xb7"/>
              <edc:DCRFieldSemantic edc:cname="PWP292K" edc:desc="First 292K" edc:when="(field &amp; 0xff) == 0xb6"/>
              <edc:DCRFieldSemantic edc:cname="PWP296K" edc:desc="First 296K" edc:when="(field &amp; 0xff) == 0xb5"/>
              <edc:DCRFieldSemantic edc:cname="PWP300K" edc:desc="First 300K" edc:when="(field &amp; 0xff) == 0xb4"/>
              <edc:DCRFieldSemantic edc:cname="PWP304K" edc:desc="First 304K" edc:when="(field &amp; 0xff) == 0xb3"/>
              <edc:DCRFieldSemantic edc:cname="PWP308K" edc:desc="First 308K" edc:when="(field &amp; 0xff) == 0xb2"/>
              <edc:DCRFieldSemantic edc:cname="PWP312K" edc:desc="First 312K" edc:when="(field &amp; 0xff) == 0xb1"/>
              <edc:DCRFieldSemantic edc:cname="PWP316K" edc:desc="First 316K" edc:when="(field &amp; 0xff) == 0xb0"/>
              <edc:DCRFieldSemantic edc:cname="PWP320K" edc:desc="First 320K" edc:when="(field &amp; 0xff) == 0xaf"/>
              <edc:DCRFieldSemantic edc:cname="PWP324K" edc:desc="First 324K" edc:when="(field &amp; 0xff) == 0xae"/>
              <edc:DCRFieldSemantic edc:cname="PWP328K" edc:desc="First 328K" edc:when="(field &amp; 0xff) == 0xad"/>
              <edc:DCRFieldSemantic edc:cname="PWP332K" edc:desc="First 332K" edc:when="(field &amp; 0xff) == 0xac"/>
              <edc:DCRFieldSemantic edc:cname="PWP336K" edc:desc="First 336K" edc:when="(field &amp; 0xff) == 0xab"/>
              <edc:DCRFieldSemantic edc:cname="PWP340K" edc:desc="First 340K" edc:when="(field &amp; 0xff) == 0xaa"/>
              <edc:DCRFieldSemantic edc:cname="PWP344K" edc:desc="First 344K" edc:when="(field &amp; 0xff) == 0xa9"/>
              <edc:DCRFieldSemantic edc:cname="PWP348K" edc:desc="First 348K" edc:when="(field &amp; 0xff) == 0xa8"/>
              <edc:DCRFieldSemantic edc:cname="PWP352K" edc:desc="First 352K" edc:when="(field &amp; 0xff) == 0xa7"/>
              <edc:DCRFieldSemantic edc:cname="PWP356K" edc:desc="First 356K" edc:when="(field &amp; 0xff) == 0xa6"/>
              <edc:DCRFieldSemantic edc:cname="PWP360K" edc:desc="First 360K" edc:when="(field &amp; 0xff) == 0xa5"/>
              <edc:DCRFieldSemantic edc:cname="PWP364K" edc:desc="First 364K" edc:when="(field &amp; 0xff) == 0xa4"/>
              <edc:DCRFieldSemantic edc:cname="PWP368K" edc:desc="First 368K" edc:when="(field &amp; 0xff) == 0xa3"/>
              <edc:DCRFieldSemantic edc:cname="PWP372K" edc:desc="First 372K" edc:when="(field &amp; 0xff) == 0xa2"/>
              <edc:DCRFieldSemantic edc:cname="PWP376K" edc:desc="First 376K" edc:when="(field &amp; 0xff) == 0xa1"/>
              <edc:DCRFieldSemantic edc:cname="PWP380K" edc:desc="First 380K" edc:when="(field &amp; 0xff) == 0xa0"/>
              <edc:DCRFieldSemantic edc:cname="PWP384K" edc:desc="First 384K" edc:when="(field &amp; 0xff) == 0x9f"/>
              <edc:DCRFieldSemantic edc:cname="PWP388K" edc:desc="First 388K" edc:when="(field &amp; 0xff) == 0x9e"/>
              <edc:DCRFieldSemantic edc:cname="PWP392K" edc:desc="First 392K" edc:when="(field &amp; 0xff) == 0x9d"/>
              <edc:DCRFieldSemantic edc:cname="PWP396K" edc:desc="First 396K" edc:when="(field &amp; 0xff) == 0x9c"/>
              <edc:DCRFieldSemantic edc:cname="PWP400K" edc:desc="First 400K" edc:when="(field &amp; 0xff) == 0x9b"/>
              <edc:DCRFieldSemantic edc:cname="PWP404K" edc:desc="First 404K" edc:when="(field &amp; 0xff) == 0x9a"/>
              <edc:DCRFieldSemantic edc:cname="PWP408K" edc:desc="First 408K" edc:when="(field &amp; 0xff) == 0x99"/>
              <edc:DCRFieldSemantic edc:cname="PWP412K" edc:desc="First 412K" edc:when="(field &amp; 0xff) == 0x98"/>
              <edc:DCRFieldSemantic edc:cname="PWP416K" edc:desc="First 416K" edc:when="(field &amp; 0xff) == 0x97"/>
              <edc:DCRFieldSemantic edc:cname="PWP420K" edc:desc="First 420K" edc:when="(field &amp; 0xff) == 0x96"/>
              <edc:DCRFieldSemantic edc:cname="PWP424K" edc:desc="First 424K" edc:when="(field &amp; 0xff) == 0x95"/>
              <edc:DCRFieldSemantic edc:cname="PWP428K" edc:desc="First 428K" edc:when="(field &amp; 0xff) == 0x94"/>
              <edc:DCRFieldSemantic edc:cname="PWP432K" edc:desc="First 432K" edc:when="(field &amp; 0xff) == 0x93"/>
              <edc:DCRFieldSemantic edc:cname="PWP436K" edc:desc="First 436K" edc:when="(field &amp; 0xff) == 0x92"/>
              <edc:DCRFieldSemantic edc:cname="PWP440K" edc:desc="First 440K" edc:when="(field &amp; 0xff) == 0x91"/>
              <edc:DCRFieldSemantic edc:cname="PWP444K" edc:desc="First 444K" edc:when="(field &amp; 0xff) == 0x90"/>
              <edc:DCRFieldSemantic edc:cname="PWP448K" edc:desc="First 448K" edc:when="(field &amp; 0xff) == 0x8f"/>
              <edc:DCRFieldSemantic edc:cname="PWP452K" edc:desc="First 452K" edc:when="(field &amp; 0xff) == 0x8e"/>
              <edc:DCRFieldSemantic edc:cname="PWP456K" edc:desc="First 456K" edc:when="(field &amp; 0xff) == 0x8d"/>
              <edc:DCRFieldSemantic edc:cname="PWP460K" edc:desc="First 460K" edc:when="(field &amp; 0xff) == 0x8c"/>
              <edc:DCRFieldSemantic edc:cname="PWP464K" edc:desc="First 464K" edc:when="(field &amp; 0xff) == 0x8b"/>
              <edc:DCRFieldSemantic edc:cname="PWP468K" edc:desc="First 468K" edc:when="(field &amp; 0xff) == 0x8a"/>
              <edc:DCRFieldSemantic edc:cname="PWP472K" edc:desc="First 472K" edc:when="(field &amp; 0xff) == 0x89"/>
              <edc:DCRFieldSemantic edc:cname="PWP476K" edc:desc="First 476K" edc:when="(field &amp; 0xff) == 0x88"/>
              <edc:DCRFieldSemantic edc:cname="PWP480K" edc:desc="First 480K" edc:when="(field &amp; 0xff) == 0x87"/>
              <edc:DCRFieldSemantic edc:cname="PWP484K" edc:desc="First 484K" edc:when="(field &amp; 0xff) == 0x86"/>
              <edc:DCRFieldSemantic edc:cname="PWP488K" edc:desc="First 488K" edc:when="(field &amp; 0xff) == 0x85"/>
              <edc:DCRFieldSemantic edc:cname="PWP492K" edc:desc="First 492K" edc:when="(field &amp; 0xff) == 0x84"/>
              <edc:DCRFieldSemantic edc:cname="PWP496K" edc:desc="First 496K" edc:when="(field &amp; 0xff) == 0x83"/>
              <edc:DCRFieldSemantic edc:cname="PWP500K" edc:desc="First 500K" edc:when="(field &amp; 0xff) == 0x82"/>
              <edc:DCRFieldSemantic edc:cname="PWP504K" edc:desc="First 504K" edc:when="(field &amp; 0xff) == 0x81"/>
              <edc:DCRFieldSemantic edc:cname="PWP508K" edc:desc="First 508K" edc:when="(field &amp; 0xff) == 0x80"/>
              <edc:DCRFieldSemantic edc:cname="PWP512K" edc:desc="First 512K" edc:when="(field &amp; 0xff) == 0x7f"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="BWP" edc:desc="Boot Flash Write Protect bit" edc:mask="0x1" edc:name="BWP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="CP" edc:desc="Code Protect" edc:mask="0x1" edc:name="CP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Protection Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:Checksum edc:beginaddr="0x1d000000" edc:checksumalgo="0x80" edc:endaddr="0x1d00ffff"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Protection Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x20" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:DCRFieldDef edc:cname="RESERVED" edc:desc="Sign" edc:ishidden="true" edc:mask="0x1" edc:name="RESERVED" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:desc="Reserved always 0" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:GPRDataSector edc:beginaddr="0x0" edc:endaddr="0x4000" edc:kseg0="0x80000000" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:kuseg="0x7f000000" edc:regionid="kseg1_data_mem"/>
    <edc:SFRDataSector edc:beginaddr="0x1f800000" edc:endaddr="0x1f80a400" edc:kseg1="0xa0000000" edc:ksegdef="2" edc:regionid="periph0">
      <edc:SFRDef edc:_addr="0x1F800000" edc:_begin="0x0" edc:_end="0x10" edc:_modsrc="DOS-01385_wdt_pwrt_pb_v2.Module" edc:_refcount="1" edc:access="----------------n--------rrrrrnn" edc:cname="WDTCON" edc:desc="" edc:grp="WDT" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------x--------xxxxxxx" edc:name="WDTCON" edc:nzwidth="0x20" edc:por="----------------0--------00000x0" edc:portals="CLR SET INV" ltx:baseofperipheral="WDT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WDTCLR" edc:desc="" edc:mask="0x1" edc:name="WDTCLR" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDTWINEN" edc:desc="" edc:mask="0x1" edc:name="WDTWINEN" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS" edc:desc="" edc:mask="0x1f" edc:name="SWDTPS" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SWDTPS0" edc:desc="" edc:mask="0x1" edc:name="SWDTPS0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS1" edc:desc="" edc:mask="0x1" edc:name="SWDTPS1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS2" edc:desc="" edc:mask="0x1" edc:name="SWDTPS2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS3" edc:desc="" edc:mask="0x1" edc:name="SWDTPS3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWDTPS4" edc:desc="" edc:mask="0x1" edc:name="SWDTPS4" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPSTA" edc:desc="" edc:mask="0x1" edc:name="WDTPSTA" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1" edc:name="WDTPS" edc:nzwidth="0x5"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
