MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX330F064H.PIC
      <edc:SFRDef edc:_addr="0x1F80FA68" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="21" edc:access="----------------------------nnnn" edc:cname="U4RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U4RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U4RXR" edc:desc="" edc:mask="0xf" edc:name="U4RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA6C" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="22" edc:access="----------------------------nnnn" edc:cname="U4CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U4CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U4CTSR" edc:desc="" edc:mask="0xf" edc:name="U4CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA70" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="23" edc:access="----------------------------nnnn" edc:cname="U5RXR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U5RXR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5RXR" edc:desc="" edc:mask="0xf" edc:name="U5RXR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA74" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="24" edc:access="----------------------------nnnn" edc:cname="U5CTSR" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="U5CTSR" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="U5CTSR" edc:desc="" edc:mask="0xf" edc:name="U5CTSR" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FA78" edc:offset="12"/>
      <edc:SFRDef edc:_addr="0x1F80FA84" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="25" edc:access="----------------------------nnnn" edc:cname="SDI1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI1R" edc:desc="" edc:mask="0xf" edc:name="SDI1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA88" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="26" edc:access="----------------------------nnnn" edc:cname="SS1R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS1R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS1R" edc:desc="" edc:mask="0xf" edc:name="SS1R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F80FA8C" edc:offset="4"/>
      <edc:SFRDef edc:_addr="0x1F80FA90" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="27" edc:access="----------------------------nnnn" edc:cname="SDI2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SDI2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SDI2R" edc:desc="" edc:mask="0xf" edc:name="SDI2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F80FA94" edc:_begin="0x0" edc:_end="0x4" edc:_modsrc="DOS-01618_RPINRx.Module" edc:_refcount="28" edc:access="----------------------------nnnn" edc:cname="SS2R" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------------------0000" edc:name="SS2R" edc:nzwidth="0x20" edc:por="----------------------------0000">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SS2R" edc:desc="" edc:mask="0xf" edc:name="SS2R" edc:nzwidth="4"/>
            <edc:AdjustPoint edc:offset="25"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
